{
  "_name_or_path": "domischwimmbeck/bert-base-german-cased-fine-tuned-ner",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-AGE",
    "2": "B-CONTACT_EMAIL",
    "3": "B-CONTACT_FAX",
    "4": "B-CONTACT_OTHER",
    "5": "B-CONTACT_PHONE",
    "6": "B-CONTACT_URL",
    "7": "B-DATE",
    "8": "B-ID",
    "9": "B-LOCATION_CITY",
    "10": "B-LOCATION_COUNTRY",
    "11": "B-LOCATION_HOSPITAL",
    "12": "B-LOCATION_ORGANIZATION",
    "13": "B-LOCATION_STREET",
    "14": "B-LOCATION_ZIP",
    "15": "B-LOC_OTHER",
    "16": "B-NAME_DOCTOR",
    "17": "B-NAME_EXT",
    "18": "B-NAME_OTHER",
    "19": "B-NAME_PATIENT",
    "20": "B-NAME_RELATIVE",
    "21": "B-NAME_TITLE",
    "22": "B-NAME_USERNAME",
    "23": "B-PROFESSION",
    "24": "I-AGE",
    "25": "I-CONTACT_EMAIL",
    "26": "I-CONTACT_FAX",
    "27": "I-CONTACT_PHONE",
    "28": "I-CONTACT_URL",
    "29": "I-DATE",
    "30": "I-ID",
    "31": "I-LOCATION_CITY",
    "32": "I-LOCATION_HOSPITAL",
    "33": "I-LOCATION_ORGANIZATION",
    "34": "I-LOCATION_STREET",
    "35": "I-LOCATION_ZIP",
    "36": "I-LOC_OTHER",
    "37": "I-NAME_DOCTOR",
    "38": "I-NAME_EXT",
    "39": "I-NAME_OTHER",
    "40": "I-NAME_PATIENT",
    "41": "I-NAME_RELATIVE",
    "42": "I-NAME_TITLE",
    "43": "I-PROFESSION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-AGE": 1,
    "B-CONTACT_EMAIL": 2,
    "B-CONTACT_FAX": 3,
    "B-CONTACT_OTHER": 4,
    "B-CONTACT_PHONE": 5,
    "B-CONTACT_URL": 6,
    "B-DATE": 7,
    "B-ID": 8,
    "B-LOCATION_CITY": 9,
    "B-LOCATION_COUNTRY": 10,
    "B-LOCATION_HOSPITAL": 11,
    "B-LOCATION_ORGANIZATION": 12,
    "B-LOCATION_STREET": 13,
    "B-LOCATION_ZIP": 14,
    "B-LOC_OTHER": 15,
    "B-NAME_DOCTOR": 16,
    "B-NAME_EXT": 17,
    "B-NAME_OTHER": 18,
    "B-NAME_PATIENT": 19,
    "B-NAME_RELATIVE": 20,
    "B-NAME_TITLE": 21,
    "B-NAME_USERNAME": 22,
    "B-PROFESSION": 23,
    "I-AGE": 24,
    "I-CONTACT_EMAIL": 25,
    "I-CONTACT_FAX": 26,
    "I-CONTACT_PHONE": 27,
    "I-CONTACT_URL": 28,
    "I-DATE": 29,
    "I-ID": 30,
    "I-LOCATION_CITY": 31,
    "I-LOCATION_HOSPITAL": 32,
    "I-LOCATION_ORGANIZATION": 33,
    "I-LOCATION_STREET": 34,
    "I-LOCATION_ZIP": 35,
    "I-LOC_OTHER": 36,
    "I-NAME_DOCTOR": 37,
    "I-NAME_EXT": 38,
    "I-NAME_OTHER": 39,
    "I-NAME_PATIENT": 40,
    "I-NAME_RELATIVE": 41,
    "I-NAME_TITLE": 42,
    "I-PROFESSION": 43,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.48.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30000
}
